电脑/linux/vi编辑器/vi编辑器.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-08-27 六 19:44 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>vi编辑器</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">vi编辑器</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline2">2. 常用快捷键</a></li>
<li><a href="#orgheadline3">3. 块选择</a></li>
<li><a href="#orgheadline10">4. 查找和替换</a>
<ul>
<li><a href="#orgheadline4">4.1. 匹配某个单词</a></li>
<li><a href="#orgheadline5">4.2. 查找历史</a></li>
<li><a href="#orgheadline6">4.3. 反向查找</a></li>
<li><a href="#orgheadline7">4.4. 锚定行的开始</a></li>
<li><a href="#orgheadline8">4.5. 锚定行的结尾</a></li>
<li><a href="#orgheadline9">4.6. 匹配空行</a></li>
</ul>
</li>
<li><a href="#orgheadline15">5. vimrc配置</a>
<ul>
<li><a href="#orgheadline11">5.1. 解决Backspace键乱码和方向键乱码</a></li>
<li><a href="#orgheadline12">5.2. 自动缩进</a></li>
<li><a href="#orgheadline13">5.3. 设置行号</a></li>
<li><a href="#orgheadline14">5.4. 开启语法高亮</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
推荐ubuntu下安装完整版的vim
</p>
<pre>
apt install vim
</pre>

<p>
这样一些按键乱码问题会自动解决。
</p>

<p>
然后注意中文输入法状态下可能会造成你切换vi模式的困扰。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline2">常用快捷键</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Ctrl + f  屏幕向下移动一页</li>

<li>G 移动到最后一行</li>

<li>gg 移动到第一行 推荐就直接用 <code>1G</code> 行跳转操作， <code>100G</code> 意思是跳转到第100行。</li>

<li>dd 删除当前行</li>

<li>yy 复制当前行</li>

<li>p 粘贴</li>

<li>u 撤销</li>

<li>r redo</li>
</ul>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline3">块选择</h2>
<div class="outline-text-2" id="text-3">
<p>
按键 <code>v</code> 进入块选择，然后移动光标进行块选择。
</p>

<ul class="org-ul">
<li>y 复制块</li>

<li>d 删除块</li>
</ul>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline10">查找和替换</h2>
<div class="outline-text-2" id="text-4">
</div><div class="outline-3">
<h3 id="orgheadline4">匹配某个单词</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>/Lao Zi</code>
</p>

<p>
这样我们就开始搜索精确匹配含有“Lao Zi”这个字符串了，如果你按 
</p>

<p>
<code>n</code>
</p>

<p>
那么就是继续查找“Lao Zi”，也就是查找下一个
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline5">查找历史</h3>
<div class="outline-text-3" id="text-4-2">
<p>
如果输入 / 然后按方向键，就如同我们在终端上直接按方向键可以调用上一个命令一样，现在我们可以调用上一次的查找命令。这个有时很有用的。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline6">反向查找</h3>
<div class="outline-text-3" id="text-4-3">
<p>
使用问号 <code>?</code> 什么就是反向查找。同样 <code>n</code> ，下一个也是反向的，你可以理解n是将上一次的查找命令重做一次。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">锚定行的开始</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<code>^</code> 符号表示一行的开始。现在我们执行如下查找命令：
</p>

<p>
<code>/^Th</code>
这算是一个小型的正则表达式匹配模式了，用自然语言来描述就是：匹配以T为行首，后面还跟一个字母h的文本。我们看到一些The和This开头的行都匹配进去了，请读者试试 /^This 来精确匹配以T为行首，后面跟着字母his的文本。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline8">锚定行的结尾</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<code>$</code> 符号表示一行的结尾。现在让我们匹配以“之。”结尾的文本：
</p>

<p>
<code>/之。$</code>
</p>

<p>
我们看到这个例子只匹配行尾和行尾前面有“之。”这两个字符的文本。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline9">匹配空行</h3>
<div class="outline-text-3" id="text-4-6">
<p>
空行的表示就是 <code>/^$</code> 。这样将会匹配每一条没有任何字符的空行。
</p>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline15">vimrc配置</h2>
<div class="outline-text-2" id="text-5">
<p>
在当前用户主文件夹下的 <code>.vimrc</code> 文件里面可以进行一些vi编辑器的定制配置。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline11">解决Backspace键乱码和方向键乱码</h3>
<div class="outline-text-3" id="text-5-1">
<pre>
set nocompatible 
set backspace=2
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline12">自动缩进</h3>
<div class="outline-text-3" id="text-5-2">
<pre>
set autoindent
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline13">设置行号</h3>
<div class="outline-text-3" id="text-5-3">
<pre>
set nu
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline14">开启语法高亮</h3>
<div class="outline-text-3" id="text-5-4">
<pre>
syntax on
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
